const seriesList = [
  {
    id: 1,
    image: "/img/Series/Stranger/card/1.jpg",
    year: "2025",
    rate: "16+",
    quality: "HD",
    description: "เมื่อเด็กชายคนหนึ่งหายตัวไป เมืองเล็กๆ แห่งนี้ก็ค้นพบเรื่องลึกลับซึ่งเกี่ยวพันกับการทดลองลับ พลังเหนือธรรมชาติอันน่าหวาดกลัว และเด็กหญิงแปลกประหลาดคนหนึ่ง"
  },
   {
    id: 2,
    image: "/img/Series/Stranger/card/2.jpg",
    year: "2025",
    rate: "16+",
    quality: "HD",
    description: "เมื่อเด็กชายคนหนึ่งหายตัวไป เมืองเล็กๆ แห่งนี้ก็ค้นพบเรื่องลึกลับซึ่งเกี่ยวพันกับการทดลองลับ พลังเหนือธรรมชาติอันน่าหวาดกลัว และเด็กหญิงแปลกประหลาดคนหนึ่ง"
  },
  {
    id: 3,
    image: "/img/Series/Stranger/card/3.jpg",
    year: "2025",
    rate: "16+",
    quality: "HD",
    description: "เมื่อเด็กชายคนหนึ่งหายตัวไป เมืองเล็กๆ แห่งนี้ก็ค้นพบเรื่องลึกลับซึ่งเกี่ยวพันกับการทดลองลับ พลังเหนือธรรมชาติอันน่าหวาดกลัว และเด็กหญิงแปลกประหลาดคนหนึ่ง"
  },
  {
    id: 4,
    image: "/img/Series/Stranger/card/4.jpg",
    year: "2025",
    rate: "16+",
    quality: "HD",
    description: "เมื่อเด็กชายคนหนึ่งหายตัวไป เมืองเล็กๆ แห่งนี้ก็ค้นพบเรื่องลึกลับซึ่งเกี่ยวพันกับการทดลองลับ พลังเหนือธรรมชาติอันน่าหวาดกลัว และเด็กหญิงแปลกประหลาดคนหนึ่ง"
  },
]

export default seriesList
