

const Movie1Seasons = [
  {
    id: 1,
    label: "Stranger Things",
    age: "13+",
    category: "ความรุนแรง",
    episodes: [
      {
        ep: 1,
        title: "บทที่หนึ่ง: การหายตัวไปของวิล ไบเออร์ส",
        duration: "49 นาที",
        description: "ระหว่างที่เดินกลับจากบ้านของเพื่อน เด็กชายวิลได้พบกับอะไรบางอย่างอันน่าสะพรึงกลัว ใกล้ๆกันนั้นเอง ความลับอันชั่วร้ายก็แฝงตัวอยู่ในห้องทดลองของรัฐบาล",
        thumbnail: "/img/Series/Stranger/Ss1/Ep1.jpg"
      },
      {
        ep: 2,
        title: "บทที่สอง: คนประหลาดบนถนนเมเปิ้ล",
        duration: "56 นาที",
        description: "ลูคัส ไมค์ และดัสตินพยายามพูดคุยกับเด็กผู้หญิงที่พวกเขาพบในป่า ฮ็อปเปอร์ก็ตั้งคำถามกับจอยซ์ผู้หวาดกลัวเกี่ยวกับสายโทรศัพท์อันแปลกประหลาด",
        thumbnail: "/img/Series/Stranger/Ss1/Ep2.jpg"
      },
      {
        ep: 3,
        title: "บทที่สาม: ฮอลลี่ จอลลี่",
        duration: "52 นาที",
        description: "แนนซี่ผู้กำลังวิตกกังวลขึ้นเรื่อยๆออกตามหาบาร์บและได้พบว่าโจนาธานกำลังทำอะไรอยู่ จอยซ์เชื่อว่าวิลกำลังพยายามสื่อสารกับเธอ",
        thumbnail: "/img/Series/Stranger/Ss1/Ep3.jpg"
      },
      {
        ep: 4,
        title: "บทที่สี่: ศพ",
        duration: "51 นาที",
        description: "จอยซ์พยายามติดต่อกับวิลลูกชายของเธอเพราะไม่เชื่อว่าเขาตายแล้ว พวกเด็กๆก็กำลังเปลี่ยนโฉมให้กับอีเลเว่น แนนซี่และโจนาธานร่วมมือกันอย่างไม่น่าเป็นไปได้",
        thumbnail: "/img/Series/Stranger/Ss1/Ep4.jpg"
      },
      {
        ep: 5,
        title: "บทที่ห้า: หมัดและนักกายกรรม",
        duration: "53 นาที",
        description: "ฮ็อปเปอร์แอบเข้าไปในห้องทดลองในขณะที่แนนซี่กับโจนาธานเผชิญหน้ากับสิ่งที่ลักพาตัววิลไป พวกเด็กๆไปถามคุณคลาร์คว่าจะเดินทางไปมิติอื่นได้อย่างไร",
        thumbnail: "/img/Series/Stranger/Ss1/Ep5.jpg"
      },
      {
        ep: 6,
        title: "บทที่หก: สัตว์ประหลาด",
        duration: "47 นาที",
        description: "ในขณะที่โจนาธานกำลังลนลานตามหาแนนซี่ในความมืด สตีฟก็กำลังตามหาเธอเช่นเดียวกัน ฮ็อปเปอร์และจอยซ์ค้นพบความจริงเกี่ยวกับการทดลอง",
        thumbnail: "/img/Series/Stranger/Ss1/Ep6.jpg"
      },
      {
        ep: 7,
        title: "บทที่เจ็ด: อ่างอาบน้ำ",
        duration: "43 นาที",
        description: "อีเลเว่นพยายามติดต่อกับวิล ส่วนลูคัสก็เตือนทุกคนว่า กลุ่มคนไม่ดีกำลังมา แนนซี่และโจนาธานเอาวิดีโอที่โจนาธานอัดเก็บไว้ไปให้ตำรวจดู",
        thumbnail: "/img/Series/Stranger/Ss1/Ep7.jpg",
      },
      {
        ep: 8,
        title: "บทที่แปด: การกลับหัว",
        duration: "53 นาที",
        description: "ดร.เบรนเนอร์จับฮ็อปเปอร์และจอยซ์ไว้เพื่อสอบถามอะไรบางอย่าง ส่วนพวกเด็กๆกำลังรออยู่พร้อมกับอีเลเว่นที่ยิม กลับไปที่บ้านของวิล แนนซี่กับโจนาธานเตรียมพร้อมสำหรับการต่อสู้",
        thumbnail: "/img/Series/Stranger/Ss1/Ep8.jpg"
      },
    ]
  },
// Ss-2
  {
    id: 2,
    label: "Stranger Things 2",
    age: "16+",
    category: "ความรุนแรง",
    episodes: [
      {
        ep: 1,
        title: "บทที่หนึ่ง: แมดแม็กซ์",
        debugger: "49 นาที",
        description: "ในระหว่างที่ทั้งเมืองเตรียมตัวต้อนรับเทศกาลฮาโลวีน ศัตรูที่น่าสะพรึงกลัวก็สร้างความปั่นป่วนไปทั่วบริเวณอาเขต ฮ็อปเปอร์จอมขี้สงสัยตัดสินใจเข้าตรวจสอบไร่ฟักทองเน่า",
        thumbnail: "/img/Series/Stranger/Ss2/Ep1.jpg"
      },
      {
        ep: 2,
        title: "บทที่สอง: ทริก ออร์ ทรีต ไอ้ตัวประหลาด",
        debugger: "56 นาที",
        description: "หลังจากวิลมองเห็นบางสิ่งที่ชวนสยองในคืนวันฮาโลวีน ไมค์ก็รู้สึกสงสัยว่าอีเลเว่นยังคงวนเวียนอยู่แถวนั้น ส่วนแนนซี่ต้องต่อสู้กับความจริงเกี่ยวกับบาร์บที่เธอรับรู้มา",
        thumbnail: "/img/Series/Stranger/Ss2/Ep2.jpg"
      },
      {
        ep: 3,
        title: "บทที่สาม: ลูกอ๊อด",
        debugger: "51 นาที",
        description: "ดัสตินรับสัตว์เลี้ยงสุดประหลาดตัวใหม่มาเลี้ยง ในขณะเดียวกันอีเลเว่นเริ่มหมดความอดทน ส่วนบ็อบผู้เจตนาดีก็อยากให้วิลยืนหยัดสู้กับความกลัว",
        thumbnail: "/img/Series/Stranger/Ss2/Ep3.jpg"
      },
      {
        ep: 4,
        title: "บทที่สี่: วิลผู้รู้",
        debugger: "47 นาที",
        description: "วิลที่กำลังไม่สบายเลือกที่จะเปิดใจกับจอยซ์ แต่ทว่าผลที่ออกมากลับไม่ใช่เรื่องดีนัก ในขณะเดียวกันฮ็อปเปอร์พยายามขุดคุ้ยความจริง ส่วนอีเลเว่นก็ได้ค้นพบเรื่องที่ชวนประหลาดใจ",
        thumbnail: "/img/Series/Stranger/Ss2/Ep4.jpg"
      },
      {
        ep: 5,
        title: "บทที่ห้า: ขุดค้น",
        debugger: "59 นาที",
        description: "แนนซี่และโจนาธานลองแลกเปลี่ยนทฤษฎีสมคบคิดกับพันธมิตรคนใหม่ ในขณะที่อีเลเว่นออกตามหาใครบางคนจากอดีต ส่วน บ็อบคนฉลาด พยายามไขปัญหาสุดหิน",
        thumbnail: "/img/Series/Stranger/Ss2/Ep5.jpg"
      },
      {
        ep: 6,
        title: "บทที่หก: สายลับ",
        debugger: "52 นาที",
        description: "ความเชื่อมโยงระหว่างวิลและปิศาจที่แสนน่ากลัวมีเพิ่มมากขึ้นทุกที แต่กลับไม่มีใครรู้วิธีที่จะหยุดยั้งมัน ในขณะเดียวกันดัสตินและสตีฟต้องร่วมมือกันอย่างเสียไม่ได้",
        thumbnail: "/img/Series/Stranger/Ss2/Ep6.jpg"
      },
      {
        ep: 7,
        title: "บทที่เจ็ด: พี่สาวที่หายไป",
        debugger: "46 นาที ",
        description: "ภาพทางจิตสุดประหลาดที่ตนเห็นทำให้อีเลเว่นตัดสินใจเข้าร่วมกับกลุ่มกบฏสังคมที่ชอบใช้ความรุนแรงและหญิงสาวขี้โมโหคนหนึ่งซึ่งมาพร้อมกับอดีตที่คลุมเครือ",
        thumbnail: "/img/Series/Stranger/Ss2/Ep7.jpg"
      },
      {
        ep: 8,
        title: "บทที่แปด: จอมเปิดโปง",
        debugger: "48 นาที",
        description: "สถานการณ์มาถึงจุดวิกฤติ ทำให้ห้องแล็บฮอว์กินส์ต้องถูกปิดตาย แต่ทว่าฮีโร่ที่คนนึกไม่ถึงกลับกล้าอาสาช่วยเหลือวิลและผู้คนจำนวนมากที่ติดอยู่ในนั้น",
        thumbnail: "/img/Series/Stranger/Ss2/Ep8.jpg"
      },
      {
        ep: 9,
        title: "บทที่เก้า: ประตู",
        debugger: "63 นาที",
        description: "อีเลเว่นคิดแผนการที่จะทำสิ่งที่เธอเริ่มต้นไว้ให้สำเร็จ ในขณะเดียวกันกลุ่มผู้รอดชีวิตต่างเตรียมพร้อมที่จะจัดการกับพลังชั่วร้ายซึ่งยึดร่างของวิลเอาไว้",
        thumbnail: "/img/Series/Stranger/Ss2/Ep9.jpg"
      },
    ]

  },
// Ss-3
  {
    id: 3,
    label: "Stranger Things 3",
    age: "16+",
    category: "ความรุนแรง",
    episodes: [
      {
        ep: 1,
        title: "บทที่หนึ่ง: ซูซี่ ทราบแล้วเปลี่ยน",
        debugger: "51 นาที",
        description: "หน้าร้อนมาพร้อมงานใหม่ๆ และความรักสุดเบ่งบาน แต่สถานการณ์กลับเปลี่ยนไปเมื่อวิทยุของดัสตินจับสัญญาณกระจายเสียงภาษารัสเซียได้ ส่วนวิลรู้สึกว่ามีบางสิ่งผิดปกติ",
        thumbnail: "/img/Series/Stranger/Ss3/Ep1.jpg"
      },
      {
        ep: 2,
        title: "บทที่สอง: เด็กห้าง",
        debugger: "51 นาที",
        description: "แนนซี่กับโจนาธานออกแกะรอยตามเบาะแส สตีฟและโรบินเข้าร่วมภารกิจลับ แม็กซ์และอีเลเว่นออกไปช้อปปิ้ง ส่วนบิลลี่ที่กำลังรู้สึกกระวนกระวายใจได้เห็นภาพนิมิตชวนสยอง",
        thumbnail: "/img/Series/Stranger/Ss3/Ep2.jpg"
      },
       {
        ep: 3,
        title: "บทที่สาม: ไขปริศนาไลฟ์การ์ดที่หายไป",
        debugger: "50 นาที",
        description: "ขณะที่แอลกับแม็กซ์ออกไปตามหาบิลลี่ วิลประกาศว่าพวกหนุ่มๆ ควรใช้เวลาโดยไม่มีพวกผู้หญิง สตีฟกับดัสตินออกไปซุ่มสังเกตการณ์ ส่วนจอยซ์กับฮ็อปเปอร์กลับไปที่ห้องแล็บฮอว์กินส์",
        thumbnail: "/img/Series/Stranger/Ss3/Ep3.jpg"
      },
       {
        ep: 4,
        title: "บทที่สี่: การทดสอบในซาวน่า",
        debugger: "53 นาที",
        description: "รหัสแดงทำให้สมาชิกแก๊งกลับมารวมพลกันอีกครั้งเพื่อเผชิญหน้ากับปีศาจสุดสะพรึงตัวเดิม คาเรนสนับสนุนให้แนนซี่ขุดคุ้ยหาข้อมูลต่อไป ส่วนโรบินพบแผนที่ที่มีประโยชน์",
        thumbnail: "/img/Series/Stranger/Ss3/Ep4.jpg"
      },
       {
        ep: 5,
        title: "บทที่ห้า: การเปิดโปง",
        debugger: "52 นาที",
        description: "เกิดเรื่องประหลาดสุดพิศวงขึ้นในบ้านไร่หลังเก่าและลึกลงไปใต้ห้างสตาร์คอร์ท ขณะเดียวกันจอมเปิดโปงกำลังรวบรวมพลังความแข็งแกร่ง",
        thumbnail: "/img/Series/Stranger/Ss3/Ep5.jpg"
      },
       {
        ep: 6,
        title: "บทที่หก: หลากหลายเป็นหนึ่งเดียว",
        debugger: "60 นาที",
        description: "ดร.อเล็กซี่เผยว่าฝ่ายรัสเซียกำลังสร้างอะไร ขณะที่อีเลเว่นเห็นว่าบิลลี่อยู่ที่ไหน ส่วนดัสตินกับเอริก้าต้องทำภารกิจเสี่ยงตาย",
        thumbnail: "/img/Series/Stranger/Ss3/Ep6.jpg"
      },
       {
        ep: 7,
        title: "บทที่เจ็ด: รอยกัด",
        debugger: "56 นาที",
        description: "เมื่อเหลือเวลาไม่มาก มือสังหารก็ตามประชิดตัวใกล้เข้ามาทุกที ฮ็อปเปอร์กับพวกจึงรีบเดินทางกลับไปที่ฮอว์กินส์ ซึ่งแอลและสมาชิกในแก๊งกำลังเตรียมตัวเปิดศึกทำสงคราม",
        thumbnail: "/img/Series/Stranger/Ss3/Ep7.jpg"
      },
       {
        ep: 8,
        title: "บทที่แปด: การต่อสู้ที่สตาร์คอร์ท",
        debugger: "78 นาที",
        description: "ศูนย์อาหารกลายเป็นลานเขย่าขวัญเมื่อจอมเปิดโปงมาถึง แต่ในความมืดมิดเบื้องล่างอาจมีสิ่งที่จะทำให้โลกตกอยู่ในความเสี่ยง",
        thumbnail: "/img/Series/Stranger/Ss3/Ep8.jpg"
      },
    ]
  },
// Ss-4
{
    id: 4,
    label: "Stranger Things 4",
    age: "16+",
    category: "ความรุนแรง",
    episodes: [
      {
        ep: 1,
        title: "บทที่ 1: เฮลไฟร์คลับ",
        debugger: "78 นาที",
        description: "แอลตกเป็นเป้านิ่งให้นักเรียนที่โรงเรียนใหม่กลั่นแกล้งและไม่อาจตอบโต้ จอยซ์ได้รับพัสดุลึกลับ ส่วนผู้เล่นขาลุยมาสร้างปรากฏการณ์ให้คืนนัดเล่นดันเจียนแอนด์ดรากอนในฮอว์กินส์",
        thumbnail: "/img/Series/Stranger/Ss4/Ep1.jpg"
      },
      {
        ep: 2,
        title: "บทที่ 2: คำสาปของเว็คนา",
        debugger: "78 นาที",
        description: "ไมค์ขึ้นเครื่องไปแคลิฟอร์เนีย ขณะที่ทั้งเมืองฮอว์กินส์ต้องหวาดผวาเมื่อมีการพบศพใครบางคน แนนซี่เดินหน้าสืบหาเบาะแส ด้านเอ็ดดี้ที่ยังไม่หายช็อกเล่าสิ่งที่เห็นให้ชาวแก๊งฟัง",
        thumbnail: "/img/Series/Stranger/Ss4/Ep2.jpg"
      },
       {
        ep: 3,
        title: "บทที่ 3: สัตว์ประหลาดและยอดมนุษย์",
        debugger: "65 นาที",
        description: "เมอร์เรย์และจอยซ์บินไปอะแลสกา ส่วนแอลต้องรับโทษจากสิ่งที่กระทำ ด้านโรบินกับแนนซี่เดินหน้าไขความจริงเรื่องพลังชั่วร้ายในฮอว์กินส์ ขณะที่ดร.โอเว่นส์มีข่าวน่าตกใจมาบอก",
        thumbnail: "/img/Series/Stranger/Ss4/Ep3.jpg"
      },
       {
        ep: 4,
        title: "บทที่ 4: ถึงบิลลี่",
        debugger: "79 นาที",
        description: "แม็กซ์ตกอยู่ในอันตรายครั้งร้ายแรงและเหลือเวลาไม่มากนัก มีคนมาเยี่ยมคนไข้รายหนึ่งในรพ.จิตเวชเพ็นน์เฮิร์ส ส่วนฮ็อปเปอร์เจอศึกหนักที่รัสเซีย",
        thumbnail: "/img/Series/Stranger/Ss4/Ep4.jpg"
      },
       {
        ep: 5,
        title: "บทที่ 5: นีน่าโปรเจกต์",
        debugger: "77 นาที",
        description: "ระหว่างที่โอเว่นส์พาแอลไปเนวาดา ซึ่งทำให้เธอต้องจำใจเผชิญหน้ากับอดีต แก๊งเด็กฮอว์กินส์ได้บุกเข้าไปค้นหาเบาะแสในบ้านร้าง ส่วนเว็คนาเล่นงานเหยื่ออีกราย",
        thumbnail: "/img/Series/Stranger/Ss4/Ep5.jpg"
      },
       {
        ep: 6,
        title: "บทที่ 6: ดำดิ่ง",
        debugger: "75 นาที",
        description: "ภารกิจเสี่ยงอันตรายเกิดผิดแผนหลังม่านเหล็ก ส่วนทีมแคลิฟอร์เนียพยายามขอความช่วยเหลือจากแฮกเกอร์คนหนึ่ง ขณะที่สตีฟขออาสาลุยเดี่ยวเพื่อทุกคน",
        thumbnail: "/img/Series/Stranger/Ss4/Ep6.jpg"
      },
       {
        ep: 7,
        title: "บทที่ 7: การสังหารที่ห้องแล็บฮอว์กินส์",
        debugger: "101 นาที",
        description: "ขณะที่ฮ็อปเปอร์เตรียมใจเปิดศึกกับอสุรกาย ดัสตินวิเคราะห์เป้าหมายของเว็คนาและถอดรหัสข้อความจากต่างมิติ ฝ่ายแอลค้นพบพลังจากความทรงจำอันเลือนรางในอดีต",
        thumbnail: "/img/Series/Stranger/Ss4/Ep7.jpg"
      },
       {
        ep: 8,
        title: "บทที่ 8: พ่อ",
        debugger: "87 นาที",
        description: "แนนซี่ได้เห็นภาพนิมิตรอันชวนตกตะลึง แอลผ่านการทดสอบครั้งสำคัญ ขณะเดียวกันที่ฮอว์กินส์ สมาชิกในกลุ่มต่างรวบรวมข้าวของต่างๆ เพื่อเตรียมพร้อมสำหรับการต่อสู้",
        thumbnail: "/img/Series/Stranger/Ss4/Ep8.jpg"
      },
      {
        ep: 9,
        title: "บทที่ 9: การติดตาม",
        debugger: "142 นาที",
        description: "ทุกคนต่างยืนหยัดต่อสู้อย่างกล้าหาญด้วยอาวุธที่คาดไม่ถึงเพื่อปกป้องฮอว์กินส์และโลกใบนี้",
        thumbnail: "/img/Series/Stranger/Ss4/Ep9.jpg"
      },
    ]
  },
// Ss-5
  {
    id: 5,
    label: "Stranger Things 5",
    age: "16+",
    category: "ความรุนแรง",
    episodes: [
      {
        ep: 1,
        title: "บทที่หนึ่ง: ภารกิจแฝงตัว",
        duration: "71 นาที",
        description: "พฤศจิกายนปี 1987 ชาวแก๊งต้องหลบเลี่ยงกองทัพเพื่อลักลอบเข้าไปตามหาเว็คนาในโลกกลับด้าน แต่พวกเขากลับมองไม่เห็นอันตรายที่อยู่ใกล้ตัวกว่าที่คิด",
        thumbnail: "/img/Series/Stranger/Ss5/Ep1.jpg"
      },
      {
        ep: 2,
        title: "บทที่สอง: การหายตัวไป ของฮอลลี่ วีลเลอร์",
        duration: "57 นาที",
        description: "หลังจากบ้านวีลเลอร์ถูกโจมตีอย่างหนักหน่วง ไมค์และแนนซี่ก็ตระหนักถึงผลร้ายจากการปกปิดความลับ ส่วนแอลกับฮ็อปเปอร์ต้องทำภารกิจช่วยเหลือพวกพ้อง",
        thumbnail: "/img/Series/Stranger/Ss5/Ep2.jpg"
      },
      {
        ep: 3,
        title: "บทที่สาม: กับดักเทิร์นโบว์",
        duration: "69 นาที",
        description: "วิลหยั่งรู้ถึงความเคลื่อนไหวของเว็คนาได้ด้วยวิธีการที่ไม่ธรรมดา ซึ่งเปิดโอกาสให้ชาวแก๊งได้เตรียมกับดักไว้รอท่า ส่วนฮอลลี่ออกสำรวจสถานที่แห่งใหม่ที่เธอไม่คุ้นเคย",
        thumbnail: "/img/Series/Stranger/Ss5/Ep3.jpg"
      },
      {
        ep: 4,
        title: "บทที่สี่: พ่อมด",
        duration: "86 นาที",
        description: "กองทัพยกระดับมาตรการควบคุมเมืองหนักขึ้น ไมค์ ลูคัส และโรบินต้องวางแผนสุดเสี่ยงเพื่อหาทางหลบหนี ส่วนแอลได้เผชิญหน้ากับศัตรูตัวฉกาจในที่สุด",
        thumbnail: "/img/Series/Stranger/Ss5/Ep4.jpg"
      },
      {
        ep: 5,
        title: "บทที่ห้า: ช็อคให้คืนชีพ",
        debugger: "68 นาที",
        description: "ชาวแก๊งวางแผนการสุดโต่ง เพื่อหาทางให้วิลกลับมาเชื่อมต่อกับจิตรวม ส่วนความสัมพันธ์ในกลุ่มเริ่มตึงเครียด ขณะที่ทุกคนช่วยกันสำรวจแล็บฮอว์กินส์ในโลกกลับด้าน",
        thumbnail: "/img/Series/Stranger/Ss5/Ep5.jpg"
      },
       {
        ep: 6,
        title: "บทที่หก: กระชากจิตหนีตาย",
        debugger: "75 นาที",
        description: "ขณะที่ฮอลลี่และแม็กซ์พยายามดิ้นรนเพื่อหนีจากจิตของเว็คนา แอลต้องหาทางเข้าไปในจิตของวิล ส่วนจอยซ์พยายามต่อสู้กับความรู้สึกผิด ส่วนโจนาธานกับแนนซี่ต้องเผชิญกับจุดเปลี่ยน",
        thumbnail: "/img/Series/Stranger/Ss5/Ep6.jpg"
      },
       {
        ep: 7,
        title: "บทที่เจ็ด: สะพาน",
        debugger: "66 นาที",
        description: "เมื่อถึงวันครบรอบการหายตัวไปของวิล ทุกคนกลับมารวมตัวกันอีกครั้งเพื่อสู้ศึกชี้ชะตาที่อาจเปลี่ยนโลกทั้งใบไปตลอดกาล",
        thumbnail: "/img/Series/Stranger/Ss5/Ep7.jpg"
      },
    ]
  },
];
export default Movie1Seasons;
