// data/movieDetailData.js
export const movieDetailData = {
  year: 2025,
  season: 5,
  age: 18,
  tags: "ความรุนแรง",
  releaseText: "ดูตอนใหม่ได้ 26 ธันวาคม เวลา 08:00 น.",
  description: "เมื่อเด็กชายคนหนึ่งหายตัวไป เมืองเล็กๆ แห่งนี้ก็ค้นพบเรื่องลึกลับซึ่งเกี่ยวพันกับการทดลองลับ พลังเหนือธรรมชาติอันน่าหวาดกลัว และเด็กหญิงแปลกประหลาดคนหนึ่ง",
  cast: ["วิโนนา ไรเดอร์", "เดวิด ฮาร์เบอร์", "มิลลี่ บ็อบบี บราวน์"],
  genre: ["ทีวีดราม่า", "ทีวีไซไฟ", "วัยรุ่น"],
  mood: ["น่ากลัว", "บอกลางร้าย", "หวนคิดถึงอดีต"],
};
